import {
  FaAccessibleIcon,
  FaBookReader,
  FaGavel,
  FaGlassWhiskey,
  FaHome,
  FaMoneyBillWave,
  FaPills,
  FaUserFriends,
} from 'react-icons/fa';

export const services = [
  {
    icon: <FaPills />,
    title: 'Помощь наркозависимым',
    description:
      'Мы предлагаем комплексную программу реабилитации и поддержки для людей, страдающих от наркотической зависимости, включая консультации, терапию и сопровождение на пути к выздоровлению.',
  },
  {
    icon: <FaGlassWhiskey />,
    title: 'Помощь алкозависимым',
    description:
      'Наша организация оказывает помощь людям, страдающим от алкогольной зависимости, предлагая программы детоксикации, психологическую поддержку и сопровождение в процессе реабилитации.',
  },
  {
    icon: <FaHome />,
    title: 'Помощь бездомным',
    description:
      'Наша организация предоставляет временное жилье, питание, одежду и другую необходимую помощь людям, оказавшимся без крова.',
  },
  {
    icon: <FaBookReader />,
    title: 'Психологическая помощь',
    description:
      'Наши квалифицированные психологи окажут вам профессиональную поддержку в преодолении эмоциональных трудностей, депрессии, тревожных расстройств и других психологических проблем.',
  },
  {
    icon: <FaGavel />,
    title: 'Юридическая консультация',
    description:
      'Наши юристы проконсультируют вас по правовым вопросам, помогут разобраться в сложных ситуациях и защитить ваши права.',
  },
  {
    icon: <FaUserFriends />,
    title: 'Семейное консультирование',
    description:
      'Мы оказываем помощь в решении семейных конфликтов, проблем в отношениях, вопросов воспитания детей и других семейных проблем.',
  },
  {
    icon: <FaMoneyBillWave />,
    title: 'Финансовое консультирование',
    description:
      'Наши финансовые консультанты помогут вам разобраться с долгами, кредитами, банкротством и другими финансовыми вопросами.',
  },
  {
    icon: <FaAccessibleIcon />,
    title: 'Помощь людям с ограниченными возможностями',
    description:
      'Мы оказываем различные виды помощи и поддержки людям с ограниченными возможностями здоровья, помогая им адаптироваться и интегрироваться в общество.',
  },
];
