export interface BeforeAfterStory {
  image: string;
  description: string;
}

export const stories: BeforeAfterStory[] = [
  {
    image: '/stories/1.webp',
    description: 'Халиф Р. 30 лет . Основная проблема - это наркотическая зависимость(синтетические вещества). В последствии проблемы с семьей и друзьями , проблемы с законом. Отчаялся и заблудился. После курса восстановления наладились отношения во всех сферах жизни, появилась цель и стал заметен результат проделанной работы.',
  },
  {
    image: '/stories/2.webp',
    description: 'Андрей К. 41 год Основная проблема - бездомный с алко- и нарко- зависимостями. Предложили ему помощь наши волонтеры , встретив его на улице в нетрезвом состоянии. Не было рядом никого из «друзей-собутыльников». Все отвернулись, остался один. Пройдя курс восстановления , жизнь стала налаживаться , новые знакомства и друзья. Стартовал Огромный прорыв в жизни.',
  },
  {
    image: '/stories/3.webp',
    description: 'Евгений Б. 52 года Основная проблема - алкогольная  зависимость. Попал в места лишения свободы. Родные отказались от общения. После отбывания срока в исправительном учреждении обратился к нам разбитым человеком. После курса восстановления изменился взгляд на жизнь , появилась новая цель и медленно движется к ней. Налаживается общение с семьей, детьми и внуками.',
  },
  {
    image: '/stories/4.webp',
    description: 'Борис Д. 33 года Основная проблема - бездомный с следствии алкогольной зависимости. Долгое время жил на чердаке дома , где проживал с родителями. Ужасный образ жизни, родители перестали пускать домой, устали. Соседи долгое время пытались помочь своими силами , но все было безуспешно. В один день кто-то из неравнодушных людей позвонил и обратился за помощью для Бориса. Спустя некоторое времени был виден колоссальный результат в изменении не только внешности , но и жизненных ценностей. Появилась цель 🎯 создать семью и быть полезным для общества человеком. Показывать на своем примере как можно измениться.',
  },
  {
    image: '/stories/5.webp',
    description: 'Олеся и Андрей К. Основная проблема - алко- и нарко- зависимости , проблемы с жильным и работой. Олеся и Андрей долгое время проходили курс восстановления в нашей организации. Где познакомили и понравились друг другу. После успешного прохождения восстановления, они решили создать семью , в чем мы им с огромным удовольствием помогли. Жизнь засеяла новыми красками и появились новые современные цели.',
  },
  {
    image: '/stories/6.webp',
   description: 'Вадим А. 27 лет Основная проблема - алкогольная и наркотическая зависимость. Начал общение в дурной компании , друг предложил попробовать наркотики , за короткое время все пошло под откос. После наркотиков на местных вечеринках все было принято запить алкоголем. Началось множество проблем не только в семье и личного характера , но и со здоровьем. Пройдя весь путь восстановления , Вадим принял решение помогать таким же как и он , людям с зависимостями , развиваясь в этом направлении. Налаживается общение с семьей и близкими людьми.' ,
  },
];
